---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsEnabled
source: html/56a22919-5574-184b-351d-17a4b6efe7b8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeAngularDimensionsEnabled Property

"Angular Dimensions"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeAngularDimensionsEnabled { get; }
```